{
    "General FAQs": {
        "IS THIS A STEM PROGRAM?": "Yes! International students are eligible to apply for the 24-month OPT STEM extension.",
        "WHEN CAN STUDENTS ENROLL AND WHAT ARE THE DEADLINES?": "The program offers both fall and spring entry. Application deadlines are posted at the beginning of the application review process. However, applications are accepted on a rolling basis well past the deadlines until the cohort capacity is reached.",
        "WHEN DO CLASSES START?": "The academic calendar is posted online on the Registrar website.",
        "IS THERE AN ORIENTATION?": "Yes! Students will attend two orientations: one hosted by the School for ALL new graduate students, and the second is a program-specific orientation focused on the program, degree requirements, etc.",
        "HOW LONG IS THE PROGRAM?": "Students can finish in 1 to 1.5 year, depending on term of entry and scheduling. Specific duration should be confirmed with the graduate coordinator based on individual situations.",
        "HOW MANY COURSES DO I HAVE TO TAKE A SEMESTER?": "To maintain full-time status, students must take 12 credits per semester. A reduced course load may be available in certain situations.",
        "WHAT IS THE STRUCTURE OF THE PROGRAM?": "The program typically requires 30 credit hours or 10 courses and is cohort based. Students must follow a set course plan for the first two semesters. Any deviations should be discussed with the graduate coordinator.",
        "CAN I TAKE MORE CREDITS IF I WANT TO?": "Students must follow the course plan for the first two semesters. Additional courses in later semesters do not count towards degree requirements unless approved.",
        "CAN I TRANSFER CREDITS?": "Students can transfer up to 6 graduate-level credits, subject to approval. A minimum grade of 'B' is required, and courses must be equivalent to those in the curriculum."
    },
    "Graduate FAQs": {
        "I am a current degree-seeking graduate student, should I register every semester?": "Yes. Continuous registration is required in each fall and spring semester until all degree requirements have been completed. Check the Registrar Student Academic Calendar and the Student Accounts Financial Liability page for drop/add, resign and financial liability deadlines.",
        "How many credits should I register for in order to be considered a full-time graduate student?": "Twelve credits is considered full time; for graduate students with a TA, GA or RA appointment, nine credits is considered full time.",
        "Can I register for fewer than 12 credits (or less than nine with an assistantship) and still be considered a full-time student?": "Near the end of your program, while studying for your comprehensive exam, working on a thesis, project or dissertation, you may be eligible for certification of full-time status. Please contact your department graduate coordinator (before the semester begins) to see if you qualify for full-time certification. If you qualify, you will file a Certification of Full-Time Status form.",
        "I have been certified as a full-time student by the Graduate School, but my loan company tells me I am not a full-time student. What is the problem?": "UB enrollment information is sent to the National Student Clearinghouse (NSC) on a monthly basis, with more frequent transmission around degree conferral dates and at the beginning of each semester. If the enrollment report has not yet been sent, your loan company may not see your current enrollment data. For more information regarding enrollment verification, please contact the Office of the Registrar.",
        "The deadline for registration has passed, but I need to add a course. What should I do?": "Contact your departments graduate coordinator to see if it is appropriate to file an exceptional registration form in order to be late-registered for a course. Departmental contact information can be found on our list of academic programs.",
        "I want (or need) to take a break from my program and will not register next semester. What should I do?": "A request for a leave of absence must be negotiated through the chair or director of graduate studies of the student's major department using a Graduate Student Petition for a Leave of Absence. The form must then be forwarded to the Office of the Registrar by the last day of classes of the semester in which the leave is to begin.",
        "I am currently enrolled in classes, but an emergency has come up and I cannot finish this semester. What should I do?": "Contact your departments graduate coordinator immediately to review your options. For qualifying emergencies, you may apply for an academic withdrawal. Eligibility criteria and required supporting documentation are outlined in the Request for Academic Withdrawal form. If you are not eligible for an academic withdrawal, you might request incomplete grades for your courses or decide to resign your courses as long as the resign deadline has not passed. Please be sure to review the Registrar’s Student Academic Calendar and the Student Accounts Financial Liability deadlines."
    }
}

